

def upper_str(user_str):
    """
    Функция преобразования регистр слов строки с нижнего в верхний
    :param user_str: строка, которую вводит ползователь
    :return: возвращает строку, в которой все слова в верхнем регистре
    """
    return user_str.upper()


def title_str(user_str):
    """
    Функция, которая меняет регистр первой буквы слов строки с нижнего на верхний
    :param user_str: строка получаемая от пользователя
    :return: возвращает строку, в которой все слова имеют первую букву в верхнем регистре
    """
    return user_str.title()
